In [8]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt

In [10]:
data=pd.read_csv("Data.csv")

In [13]:
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [15]:
#categorical data handling
# X = data.iloc[:, :-1].values
# y = data.iloc[:, 3].values

In [22]:
X =data.iloc[:,:-1]
X

   Country   Age   Salary
0   France  44.0  72000.0
1    Spain  27.0  48000.0
2  Germany  30.0  54000.0
3    Spain  38.0  61000.0
4  Germany  40.0      NaN
5   France  35.0  58000.0
6    Spain   NaN  52000.0
7   France  48.0  79000.0
8  Germany  50.0  83000.0
9   France  37.0  67000.0

# Handling missing values

In [104]:
X=data.iloc[:,0:3].values
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, nan],
       ['France', 35.0, 58000.0],
       ['Spain', nan, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [105]:
y=data.iloc[:,3].values
y

array(['No', 'Yes', 'No', 'No', 'Yes', 'Yes', 'No', 'Yes', 'No', 'Yes'],
      dtype=object)

In [57]:
# #handling the missing values
# from sklearn.preprocessing import Imputer
# imputer = Imputer(missing_values = 'NaN', strategy = 'mean', axis = 0)
# imputer = imputer.fit(X[:, 1:3])
# X[:, 1:3] = imputer.transform(X[:, 1:3])

In [106]:
from sklearn.preprocessing import Imputer

In [107]:
imputer=Imputer(missing_values="NaN",strategy="mean",axis=0)

In [108]:
# 0=>columns 1=>row
X[:,1:3]=imputer.fit_transform(X[:,1:3])

In [83]:
(44+27+30+38+40+35+48+50+37)/9

38.77777777777778

In [109]:
X

array([['France', 44.0, 72000.0],
       ['Spain', 27.0, 48000.0],
       ['Germany', 30.0, 54000.0],
       ['Spain', 38.0, 61000.0],
       ['Germany', 40.0, 63777.77777777778],
       ['France', 35.0, 58000.0],
       ['Spain', 38.77777777777778, 52000.0],
       ['France', 48.0, 79000.0],
       ['Germany', 50.0, 83000.0],
       ['France', 37.0, 67000.0]], dtype=object)

In [89]:
#categorical data handline

# Handling categorical data

In [110]:
from sklearn.preprocessing import LabelEncoder,OneHotEncoder

In [111]:
labelencoder_X=LabelEncoder()

In [112]:
X[:,0]=labelencoder_X.fit_transform(X[:,0])
onehotencoder=OneHotEncoder(categorical_features=[0])
X=onehotencoder.fit_transform(X).toarray()

In [136]:
X

array([[1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 4.40000000e+01,
        7.20000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 2.70000000e+01,
        4.80000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 3.00000000e+01,
        5.40000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 3.80000000e+01,
        6.10000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 4.00000000e+01,
        6.37777778e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 3.50000000e+01,
        5.80000000e+04],
       [0.00000000e+00, 0.00000000e+00, 1.00000000e+00, 3.87777778e+01,
        5.20000000e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 4.80000000e+01,
        7.90000000e+04],
       [0.00000000e+00, 1.00000000e+00, 0.00000000e+00, 5.00000000e+01,
        8.30000000e+04],
       [1.00000000e+00, 0.00000000e+00, 0.00000000e+00, 3.70000000e+01,
        6.70000000e+04]])

In [ ]:
# 100=france
# 001=spain
# 010=germany
# 001=spain

In [116]:
# pd.DataFrame(X)

In [117]:
# array([['France', 44.0, 72000.0],
#        ['Spain', 27.0, 48000.0],
#        ['Germany', 30.0, 54000.0],
#        ['Spain', 38.0, 61000.0],
#        ['Germany', 40.0, 63777.77777777778],
#        ['France', 35.0, 58000.0],
#        ['Spain', 38.77777777777778, 52000.0],
#        ['France', 48.0, 79000.0],
#        ['Germany', 50.0, 83000.0],
#        ['France', 37.0, 67000.0]], dtype=object)

# Label encoder

In [118]:
labelencoder_y = LabelEncoder()
y = labelencoder_y.fit_transform(y)

In [120]:
y

array([0, 1, 0, 0, 1, 1, 0, 1, 0, 1], dtype=int64)

# Train test split

In [126]:
# Splitting the data into training set and test set
from sklearn.model_selection import train_test_split

In [135]:
data=pd.read_csv("Data.csv")
data

   Country   Age   Salary Purchased
0   France  44.0  72000.0        No
1    Spain  27.0  48000.0       Yes
2  Germany  30.0  54000.0        No
3    Spain  38.0  61000.0        No
4  Germany  40.0      NaN       Yes
5   France  35.0  58000.0       Yes
6    Spain   NaN  52000.0        No
7   France  48.0  79000.0       Yes
8  Germany  50.0  83000.0        No
9   France  37.0  67000.0       Yes

In [137]:
X_train,X_test,y_train,y_test=train_test_split(X,y,test_size = 0.2)

In [127]:
# def sampling():
#     a=1
#     b=2
#     c=3
#     d=4
#     return (a,b,c,d)

In [138]:
# ch= sampling()

In [143]:
pd.DataFrame(y_test)

   0
0  0
1  1